erpdev.СХК_Расширение/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ce59e7d4-ce32-4e73-8b06-cda594aec2b3">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f624df26-f68d-4892-b33d-cf2ef3cdaa0c">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="987ffccd-246d-49b8-a223-e53d76678887">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="861931ca-dadf-424e-9e87-cc6fec41bf47">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ plotnikov@syspod.ru #84483
	БанковскийСчетИР = ПолучитьБанковскийСчетИмяРеквизита();
	Если БанковскийСчетИР <> Неопределено Тогда
		БанковскийСчет = ЭтаФорма.Элементы[БанковскийСчетИР];
		БанковскийСчет.РежимВыбораИзСписка = Истина;
		БанковскийСчет.УстановитьДействие("ПриИзменении", "БанковскиеСчетаНачалоВыбораИзСписка");	
		ЗаполнитьСписокВыбора(БанковскийСчет);
	КонецЕсли;
	//-- plotnikov@syspod.ru #84483
КонецПроцедуры

Функция ПолучитьБанковскийСчетИмяРеквизита()
	мБК = Этаформа.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Наименование", "!Банковский счет для заказов"));
	Если мБК.Количество() > 0 Тогда
		Возврат мБК[0].ИмяРеквизитаЗначение;	
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура БанковскиеСчетаНачалоВыбораИзСписка(Элемент)
	//++ plotnikov@syspod.ru #84483
	БанковскийСчетИР = ПолучитьБанковскийСчетИмяРеквизита();
	Если  БанковскийСчетИР <> Неопределено Тогда
		Счет = ЭтотОбъект[БанковскийСчетИР];
		Счет = Элемент.СписокВыбора[0].Значение;
	КонецЕсли;
	//-- plotnikov@syspod.ru #84483
КонецПроцедуры

Процедура ЗаполнитьСписокВыбора(БанковскийСчет)
	//++ plotnikov@syspod.ru #84483
	Реквизиты = ЭтотОбъект.Объект.Партнер.ДополнительныеРеквизиты;
	Для каждого Рек Из Реквизиты Цикл
		Если Рек.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Организация (Общие)") Тогда;
			ОрганизацияРек = Рек.Значение;	
		КонецЕсли;
	КонецЦикла;
	
	Запрос1 = Новый Запрос("
	|ВЫБРАТЬ
	|	БанковскиеСчетаОрганизаций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|ГДЕ
	|	БанковскиеСчетаОрганизаций.Владелец.ГоловнаяОрганизация = &ГоловнаяОрганизация
	|	И БанковскиеСчетаОрганизаций.Закрыт = &Закрыт");
	
	Запрос1.УстановитьПараметр("ГоловнаяОрганизация",ОрганизацияРек);
	Запрос1.УстановитьПараметр("Закрыт", Ложь);
	
	РезультатЗапроса = Запрос1.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		БанковскийСчет.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	//-- plotnikov@syspod.ru #84483
	
КонецПроцедуры
